ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/DownMixer_1_UABH_A_regs.h
/*check results of mapping
1. All vin mapped
2. x0,x1,x2, and x3 are in range of 0 to 3
3. x0,x1,x2, and x3 are unique
*/
#if !( (DownMixer_1_UABH_A__X4_FLAGS==0xF) && \
    ( (0<=DownMixer_1_UABH_A_X0) && (DownMixer_1_UABH_A_X0<=3) ) && \
    ( (0<=DownMixer_1_UABH_A_X1) && (DownMixer_1_UABH_A_X1<=3) ) && \
    ( (0<=DownMixer_1_UABH_A_X2) && (DownMixer_1_UABH_A_X2<=3) ) && \
    ( (0<=DownMixer_1_UABH_A_X3) && (DownMixer_1_UABH_A_X3<=3) ) && \
    (DownMixer_1_UABH_A_X0!=DownMixer_1_UABH_A_X1) && \
    (DownMixer_1_UABH_A_X1!=DownMixer_1_UABH_A_X2) && \
    (DownMixer_1_UABH_A_X2!=DownMixer_1_UABH_A_X3) )
#error "bad x input to vin mapping"
#endif

#define DownMixer_1_UABH_A_XIN_COUNT 4UL



/* UAB half shared switch assymmetry special cases */
#define DownMixer_1_UABH_A_AGND_TIED_ADDR (DownMixer_1_UABH_A_halfuab__AGND_TIED)
#define DownMixer_1_UABH_A_AGND_TIED_PTR  ((reg32*)DownMixer_1_UABH_A_AGND_TIED_ADDR)
#define DownMixer_1_UABH_A_AGND_TIED_REG  (*(DownMixer_1_UABH_A_AGND_TIED_PTR))

#define DownMixer_1_UABH_A_REF_TIED_PTR  ((reg32*)DownMixer_1_UABH_A_halfuab__REF_TIED)
#define DownMixer_1_UABH_A_REF_TIED_REG  (*(DownMixer_1_UABH_A_REF_TIED_PTR))

#define DownMixer_1_UABH_A_SW_AA_PTR     ((reg32*)DownMixer_1_UABH_A_halfuab__SW_AA)
#define DownMixer_1_UABH_A_SW_AA_REG     (*(DownMixer_1_UABH_A_SW_AA_PTR))

#define DownMixer_1_UABH_A_SW_BB_PTR     ((reg32*)DownMixer_1_UABH_A_halfuab__SW_BB)
#define DownMixer_1_UABH_A_SW_BB_REG     (*(DownMixer_1_UABH_A_SW_BB_PTR))

#define DownMixer_1_UABH_A_SW_CC_ADDR     (DownMixer_1_UABH_A_halfuab__SW_CC)
#define DownMixer_1_UABH_A_SW_CC_PTR     ((reg32*)DownMixer_1_UABH_A_SW_CC_ADDR)
#define DownMixer_1_UABH_A_SW_CC_REG     (*(DownMixer_1_UABH_A_SW_CC_PTR))

#define DownMixer_1_UABH_A_ISPAIRED      (DownMixer_1_UABH_A_halfuab__ISPAIRED)

#define DownMixer_1_UABH_A_UAB_CTRL_ADDR                 (DownMixer_1_UABH_A_halfuab__UAB_CTRL)
#define DownMixer_1_UABH_A_UAB_CTRL_PTR                 ((reg32*)DownMixer_1_UABH_A_UAB_CTRL_ADDR)
#define DownMixer_1_UABH_A_UAB_CTRL_REG                 (*(DownMixer_1_UABH_A_UAB_CTRL_PTR))

#define DownMixer_1_UABH_A_INTR_ADDR                     (DownMixer_1_UABH_A_halfuab__INTR)
#define DownMixer_1_UABH_A_INTR_PTR                     ((reg32*)DownMixer_1_UABH_A_INTR_ADDR)
#define DownMixer_1_UABH_A_INTR_REG                     (*(DownMixer_1_UABH_A_INTR_PTR))

#define DownMixer_1_UABH_A_INTR_SET_ADDR                 (DownMixer_1_UABH_A_halfuab__INTR_SET)
#define DownMixer_1_UABH_A_INTR_SET_PTR                 ((reg32*)DownMixer_1_UABH_A_INTR_SET_ADDR)
#define DownMixer_1_UABH_A_INTR_SET_REG                 (*(DownMixer_1_UABH_A_INTR_SET_PTR))

#define DownMixer_1_UABH_A_INTR_MASK_ADDR                (DownMixer_1_UABH_A_halfuab__INTR_MASK)
#define DownMixer_1_UABH_A_INTR_MASK_PTR                ((reg32*)DownMixer_1_UABH_A_INTR_MASK_ADDR)
#define DownMixer_1_UABH_A_INTR_MASK_REG                (*(DownMixer_1_UABH_A_INTR_MASK_PTR))

#define DownMixer_1_UABH_A_INTR_MASKED_ADDR              (DownMixer_1_UABH_A_halfuab__INTR_MASKED)
#define DownMixer_1_UABH_A_INTR_MASKED_PTR              ((reg32*)DownMixer_1_UABH_A_INTR_MASKED_ADDR)
#define DownMixer_1_UABH_A_INTR_MASKED_REG              (*(DownMixer_1_UABH_A_INTR_MASKED_PTR))

#define DownMixer_1_UABH_A_OA_CTRL_ADDR                  (DownMixer_1_UABH_A_halfuab__OA_CTRL)
#define DownMixer_1_UABH_A_OA_CTRL_PTR                  ((reg32*)DownMixer_1_UABH_A_OA_CTRL_ADDR)
#define DownMixer_1_UABH_A_OA_CTRL_REG                  (*(DownMixer_1_UABH_A_OA_CTRL_PTR))

#define DownMixer_1_UABH_A_CAP_CTRL_ADDR                 (DownMixer_1_UABH_A_halfuab__CAP_CTRL)
#define DownMixer_1_UABH_A_CAP_CTRL_PTR                 ((reg32*)DownMixer_1_UABH_A_CAP_CTRL_ADDR)
#define DownMixer_1_UABH_A_CAP_CTRL_REG                 (*(DownMixer_1_UABH_A_CAP_CTRL_PTR))

#define DownMixer_1_UABH_A_CAP_ABCF_VAL_ADDR             (DownMixer_1_UABH_A_halfuab__CAP_ABCF_VAL)
#define DownMixer_1_UABH_A_CAP_ABCF_VAL_PTR             ((reg32*)DownMixer_1_UABH_A_CAP_ABCF_VAL_ADDR)
#define DownMixer_1_UABH_A_CAP_ABCF_VAL_REG             (*(DownMixer_1_UABH_A_CAP_ABCF_VAL_PTR))

#define DownMixer_1_UABH_A_CAP_AB_VAL_NXT_ADDR           (DownMixer_1_UABH_A_halfuab__CAP_AB_VAL_NXT)
#define DownMixer_1_UABH_A_CAP_AB_VAL_NXT_PTR           ((reg32*)DownMixer_1_UABH_A_CAP_AB_VAL_NXT_ADDR)
#define DownMixer_1_UABH_A_CAP_AB_VAL_NXT_REG           (*(DownMixer_1_UABH_A_CAP_AB_VAL_NXT_PTR))

#define DownMixer_1_UABH_A_CAP_CF_VAL_NXT_ADDR           (DownMixer_1_UABH_A_halfuab__CAP_CF_VAL_NXT)
#define DownMixer_1_UABH_A_CAP_CF_VAL_NXT_PTR           ((reg32*)DownMixer_1_UABH_A_CAP_CF_VAL_NXT_ADDR)
#define DownMixer_1_UABH_A_CAP_CF_VAL_NXT_REG           (*(DownMixer_1_UABH_A_CAP_CF_VAL_NXT_PTR))

#define DownMixer_1_UABH_A_STARTUP_DELAY_ADDR            (DownMixer_1_UABH_A_halfuab__STARTUP_DELAY)
#define DownMixer_1_UABH_A_STARTUP_DELAY_PTR            ((reg32*)DownMixer_1_UABH_A_STARTUP_DELAY_ADDR)
#define DownMixer_1_UABH_A_STARTUP_DELAY_REG            (*(DownMixer_1_UABH_A_STARTUP_DELAY_PTR))

#define DownMixer_1_UABH_A_SUBSAMPLE_CTRL_ADDR           (DownMixer_1_UABH_A_halfuab__SUBSAMPLE_CTRL)
#define DownMixer_1_UABH_A_SUBSAMPLE_CTRL_PTR           ((reg32*)DownMixer_1_UABH_A_SUBSAMPLE_CTRL_ADDR)
#define DownMixer_1_UABH_A_SUBSAMPLE_CTRL_REG           (*(DownMixer_1_UABH_A_SUBSAMPLE_CTRL_PTR))

#define DownMixer_1_UABH_A_SW_STATIC_ADDR               (DownMixer_1_UABH_A_halfuab__SW_STATIC )
#define DownMixer_1_UABH_A_SW_STATIC_PTR                ((reg32*)DownMixer_1_UABH_A_SW_STATIC_ADDR)
#define DownMixer_1_UABH_A_SW_STATIC_REG                (*(DownMixer_1_UABH_A_SW_STATIC_PTR))

#define DownMixer_1_UABH_A_SW_MODBIT_SRC_ADDR            (DownMixer_1_UABH_A_halfuab__SW_MODBIT_SRC)
#define DownMixer_1_UABH_A_SW_MODBIT_SRC_PTR            ((reg32*)DownMixer_1_UABH_A_SW_MODBIT_SRC_ADDR)
#define DownMixer_1_UABH_A_SW_MODBIT_SRC_REG            (*(DownMixer_1_UABH_A_SW_MODBIT_SRC_PTR))

