ckuzma/cypress-sensor-hub/PSoC Firmware/EnvironmentSensing.cydsn/Generated_Source/PSoC4/DownMixer_1_UABH_A_regs.h
#define DownMixer_1_UABH_A_SW_ZC_SHIFT                  CyUAB_SW_ZC_SHIFT
#define DownMixer_1_UABH_A_SW_ZC_MASK                   (0xfUL<<DownMixer_1_UABH_A_SW_ZC_SHIFT)


/*SW_CF_BOT*/
#define DownMixer_1_UABH_A_SW_GF_SHIFT                  CyUAB_SW_GF_SHIFT
#define DownMixer_1_UABH_A_SW_GF_MASK                   (0xfUL<<DownMixer_1_UABH_A_SW_GF_SHIFT)

#define DownMixer_1_UABH_A_SW_PF_SHIFT                  CyUAB_SW_PF_SHIFT
#define DownMixer_1_UABH_A_SW_PF_MASK                   (0xfUL<<DownMixer_1_UABH_A_SW_PF_SHIFT)

#define DownMixer_1_UABH_A_SW_PS_SHIFT                  CyUAB_SW_PS_SHIFT
#define DownMixer_1_UABH_A_SW_PS_MASK                   (0xfUL<<DownMixer_1_UABH_A_SW_PS_SHIFT)

#define DownMixer_1_UABH_A_SW_PO_SHIFT                  CyUAB_SW_PO_SHIFT
#define DownMixer_1_UABH_A_SW_PO_MASK                   (0xfUL<<DownMixer_1_UABH_A_SW_PO_SHIFT)


/*SW_OTHER*/
#define DownMixer_1_UABH_A_CMP_FF_SHIFT                 CyUAB_CMP_FF_SHIFT
#define DownMixer_1_UABH_A_CMP_FF_MASK                  (0xfUL<<DownMixer_1_UABH_A_CMP_FF_SHIFT)

#define DownMixer_1_UABH_A_VALID_SHIFT                  CyUAB_VALID_SHIFT
#define DownMixer_1_UABH_A_VALID_MASK                   (0xfUL<<DownMixer_1_UABH_A_VALID_SHIFT)

#define DownMixer_1_UABH_A_TRIG_OUT_SHIFT               CyUAB_TRIG_OUT_SHIFT
#define DownMixer_1_UABH_A_TRIG_OUT_MASK                (0xfUL<<DownMixer_1_UABH_A_TRIG_OUT_SHIFT)

#define DownMixer_1_UABH_A_STROBE_SW_SHIFT              CyUAB_STROBE_SW_SHIFT
#define DownMixer_1_UABH_A_STROBE_SW_MASK               (0xfUL<<DownMixer_1_UABH_A_STROBE_SW_SHIFT)

#define DownMixer_1_UABH_A_STROBE_RST_SHIFT             CyUAB_STROBE_RST_SHIFT
#define DownMixer_1_UABH_A_STROBE_RST_MASK              (0xfUL<<DownMixer_1_UABH_A_STROBE_RST_SHIFT)


/*SW_BOOST_CTRL*/
#define DownMixer_1_UABH_A_CA_BOOST_SHIFT               CyUAB_CA_BOOST_SHIFT
#define DownMixer_1_UABH_A_CA_BOOST_MASK                (0xfUL<<DownMixer_1_UABH_A_CA_BOOST_SHIFT)

#define DownMixer_1_UABH_A_CB_BOOST_SHIFT               CyUAB_CB_BOOST_SHIFT
#define DownMixer_1_UABH_A_CB_BOOST_MASK                (0xfUL<<DownMixer_1_UABH_A_CB_BOOST_SHIFT)

#define DownMixer_1_UABH_A_CC_BOOST_SHIFT               CyUAB_CC_BOOST_SHIFT
#define DownMixer_1_UABH_A_CC_BOOST_MASK                (0xfUL<<DownMixer_1_UABH_A_CC_BOOST_SHIFT)

#define DownMixer_1_UABH_A_CF_BOOST_SHIFT               CyUAB_CF_BOOST_SHIFT
#define DownMixer_1_UABH_A_CF_BOOST_MASK                (0xfUL<<DownMixer_1_UABH_A_CF_BOOST_SHIFT)

#define DownMixer_1_UABH_A_SUM_BOOST_SHIFT              CyUAB_SUM_BOOST_SHIFT
#define DownMixer_1_UABH_A_SUM_BOOST_MASK               (0xfUL<<DownMixer_1_UABH_A_SUM_BOOST_SHIFT)

#define DownMixer_1_UABH_A_PUMP_WAVE_SHIFT              CyUAB_PUMP_WAVE_SHIFT
#define DownMixer_1_UABH_A_PUMP_WAVE_MASK               (0xfUL<<DownMixer_1_UABH_A_PUMP_WAVE_SHIFT)


/*SRAM_CTRL*/
#define DownMixer_1_UABH_A_LAST_STEP_SHIFT              CyUAB_LAST_STEP_SHIFT
#define DownMixer_1_UABH_A_LAST_STEP_MASK               (0xfUL<<DownMixer_1_UABH_A_LAST_STEP_SHIFT)

#define DownMixer_1_UABH_A_TRIG_SEL_SHIFT               CyUAB_TRIG_SEL_SHIFT
#define DownMixer_1_UABH_A_TRIG_SEL_MASK                (0x1fUL<<DownMixer_1_UABH_A_TRIG_SEL_SHIFT)

#define DownMixer_1_UABH_A_TRIGGER_EN_SHIFT             CyUAB_TRIGGER_EN_SHIFT
#define DownMixer_1_UABH_A_TRIGGER_EN_MASK              (1UL<<DownMixer_1_UABH_A_TRIGGER_EN_SHIFT)

#define DownMixer_1_UABH_A_RUN_SHIFT                    CyUAB_RUN_SHIFT
#define DownMixer_1_UABH_A_RUN_MASK                     (1UL<<DownMixer_1_UABH_A_RUN_SHIFT)


/*STAT*/
#define DownMixer_1_UABH_A_CURR_STEP_SHIFT              CyUAB_CURR_STEP_SHIFT
#define DownMixer_1_UABH_A_CURR_STEP_MASK               (0xfUL<<DownMixer_1_UABH_A_CURR_STEP_SHIFT)

#define DownMixer_1_UABH_A_COMP_SHIFT                   CyUAB_COMP_SHIFT
#define DownMixer_1_UABH_A_COMP_MASK                    (1UL<<DownMixer_1_UABH_A_COMP_SHIFT)

#define DownMixer_1_UABH_A_CURR_SUBSAMPLE_SHIFT         CyUAB_CURR_SUBSAMPLE_SHIFT
#define DownMixer_1_UABH_A_CURR_SUBSAMPLE_MASK          (0xffUL<<DownMixer_1_UABH_A_CURR_SUBSAMPLE_SHIFT)


/*SRAM*/
#define DownMixer_1_UABH_A_WAVE_STEP_SHIFT              CyUAB_WAVE_STEP_SHIFT
#define DownMixer_1_UABH_A_WAVE_STEP_MASK               (0x0000ffffUL)


/*CAP_TRIM*/
#define DownMixer_1_UABH_A_CBTC_VAL_SHIFT               CyUAB_CBTC_VAL_SHIFT
#define DownMixer_1_UABH_A_CBTC_VAL_MASK                (0x7UL<<DownMixer_1_UABH_A_CBTC_VAL_SHIFT)

#define DownMixer_1_UABH_A_CCTC_VAL_SHIFT               CyUAB_CCTC_VAL_SHIFT
#define DownMixer_1_UABH_A_CCTC_VAL_MASK                (0x7UL<<DownMixer_1_UABH_A_CCTC_VAL_SHIFT)


/*OA_TRIM*/
#define DownMixer_1_UABH_A_OA_OFFSET_SHIFT              CyUAB_OA_OFFSET_SHIFT
#define DownMixer_1_UABH_A_OA_OFFSET_MASK               (0xfUL<<DownMixer_1_UABH_A_OA_OFFSET_SHIFT)

#define DownMixer_1_UABH_A_REF_OFFSET_SHIFT             CyUAB_REF_OFFSET_SHIFT
#define DownMixer_1_UABH_A_REF_OFFSET_MASK              (0x1fUL<<DownMixer_1_UABH_A_REF_OFFSET_SHIFT)

#define DownMixer_1_UABH_A_AGND_OFFSET_SHIFT            CyUAB_AGND_OFFSET_SHIFT
#define DownMixer_1_UABH_A_AGND_OFFSET_MASK             (0x1fUL<<DownMixer_1_UABH_A_AGND_OFFSET_SHIFT)



#define DownMixer_1_UABH_A_DAC_NEXT_MASK (CyUAB_DAC_NEXT_MASK)


#endif
